/*Задача 3: Не используя рекурсию, выведите первые N чисел Фибоначчи. Первые два числа Фибоначчи: 0 и 1.
                        (F0 = 0)
                        (F1 = 1)
F n =F n − 1 + F n − 2  (F2 = 1 + 0 = 1)
                        (F3 = 1 + 1 = 2)
                        (F4 = 2 + 1 = 3)
                        (F5 = 3 + 2 = 5)
Если N = 5 -> 0 1 1 2 3
Если N = 3 -> 0 1 1
Если N = 7 -> 0 1 1 2 3 5 8*/ 


int tmp1 = 0;
int tmp2 = 1;
int n = 10;

for (int i = 0; i < n+1; i++)
{
   int tmp = tmp1 + tmp2;
   System.Console.WriteLine($"F{i} = {tmp1}");
   tmp1 = tmp2;
   tmp2 = tmp;
}